![image](https://github.com/nazirov21/6-semestr/assets/113089463/68b25440-01ae-40c3-a4a2-3ca33df61771)
![image](https://github.com/nazirov21/6-semestr/assets/113089463/339da61e-f4df-46f6-af89-c94b32fd54ae)
![image](https://github.com/nazirov21/6-semestr/assets/113089463/da69a136-8fd3-452a-950f-d4becc7ceb2d)
![image](https://github.com/nazirov21/6-semestr/assets/113089463/fd74fc1e-e69b-4ca6-87d9-5bc473de7e98)
![image](https://github.com/nazirov21/6-semestr/assets/113089463/5184dca1-bb19-4b72-9a6d-872c133e98be)
![image](https://github.com/nazirov21/6-semestr/assets/113089463/2027add0-d3e3-4e9c-b833-959d92c1c4eb)


требования:

Теория тестирования и документация
Знание предмета которое тестируется
Использовать инструменты тестирования
Тестирование:

Включен во все активности жизненого цикла
Статическое(без исполнения кода) Динамическое (во время выполнения)
Оценивается ожидание или реальность
Обект - (что сравнивается): отдельный модуль компонент подсистема система Базис - (с чем сравнивается) Дефект: 1 Программа не делает что надо делать 2 делает то что не надо 3 делает то что не упоминалось 4 программа не удобна ошибка -> дефект -> отказ Пример:

Некорректные требования: Не правильная цветовая гамма Верификация - Валидация Качество:
Субьективность
Минимальные требования выполнены
удовлетворяет потребности обеспечение качества (разработчик) Контроль усоверщенсвование Контроль качества (тестировщик) тестирование рецензирование статический анализ 7 принципов
Наличие дефектов (все найти невозможно)
исчерпывающе тестирование недопустимо
раннее тестирование
скопление деФЕКТОВ
парадокс пестицида (повторяя одно и тоже не найти новые дефекты)
тестирование зависит от контекста
не забываем про пользователя
